Documents/КорректировкаНазначенияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>КорректировкаНазначенияТоваров</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыОперацийКорректировкиНазначения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>ВидыОперацийКорректировкиНазначения</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СнятьРезерв</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятьРезервПоМногимНазначениям</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезервироватьИКорректировать</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Резервировать</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольнаяКорректировкаНазначений</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/КорректировкаНазначенияТоваров/Ext/ObjectModule.bsl
&Перед("ПередЗаписью")
Процедура гф_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// #wortmann {
	// #5.2.08
	// ID запрет ручного изменения документа, при наличии свойства "гф_ДокументОснование"
	// Галфинд Volkov 2022/08/23
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Проверка = Истина;
	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("гф_ДокументОснование") И ЗначениеЗаполнено(ЭтотОбъект.ДокументОснование)
		И Не ЭтотОбъект.ДополнительныеСвойства.Свойство("гф_ДокументСозданАвтоматически")
		И Проверка Тогда
		Отказ = Истина;
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Данный документ не доступен для ручного изменения. Введен на основании %1.'"), ЭтотОбъект.ДокументОснование);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект.ДокументОснование, , , Отказ);
	КонецЕсли;
	// } #wortmann
КонецПроцедуры

&Перед("ОбработкаПроверкиЗаполнения")
Процедура гф_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// #wortmann {
	// #5.2.08
	// отказ проведения, если Склад имеет дополнительный реквизит "гф_ТоварыВКоробах" со значением Истина
	// и не заполнено поле IDКороба
	// Галфинд Sakovich 2022/09/20
	Если (ВидОперации = Перечисления.ВидыОперацийКорректировкиНазначения.СнятьРезерв
		ИЛИ ВидОперации = Перечисления.ВидыОперацийКорректировкиНазначения.СнятьРезервПоМногимНазначениям
		ИЛИ ВидОперации =  Перечисления.ВидыОперацийКорректировкиНазначения.Резервировать
		ИЛИ ВидОперации = Перечисления.ВидыОперацийКорректировкиНазначения.РезервироватьИКорректировать) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Товары.НомерСтроки,
		|	Товары.Склад,
		|	Товары.гф_IDкороба
		|ПОМЕСТИТЬ Товары
		|ИЗ
		|	&Товары КАК Товары
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СкладыДополнительныеРеквизиты.Ссылка КАК Склад
		|ПОМЕСТИТЬ СкладыСТоварамиВКоробах
		|ИЗ
		|	Справочник.Склады.ДополнительныеРеквизиты КАК СкладыДополнительныеРеквизиты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
		|		ПО (СкладыДополнительныеРеквизиты.Свойство = ДополнительныеРеквизитыИСведения.Ссылка)
		|ГДЕ
		|	ДополнительныеРеквизитыИСведения.Имя = ""гф_СкладыТоварыВКоробах"" 
		|	И  СкладыДополнительныеРеквизиты.Значение  = ИСТИНА
		|;
		|/////////////////////////
		|ВЫБРАТЬ 
		|	Товары.Склад,
		|	Товары.гф_IDкороба,
		|	Товары.НомерСтроки
		|ИЗ
		|	Товары КАК Товары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СкладыСТоварамиВКоробах КАК Склады
		|		ПО Товары.Склад = Склады.Склад
		|ГДЕ
		|	Товары.гф_IDкороба = Значение(Документ.УпаковочныйЛист.ПустаяСсылка)";
		Запрос.УстановитьПараметр("Товары", Товары.Выгрузить(, "НомерСтроки, Склад, гф_IDкороба"));
		
		УстановитьПривилегированныйРежим(Истина);
		Результат = Запрос.Выполнить();
		
		Если Не Результат.Пустой() Тогда
			ШаблонСообщения = НСтр("ru = 'Не заполнено значение в поле ""ID короба"" в строке %НомерСтроки%.'");
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%НомерСтроки%", Выборка.НомерСтроки);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , "Объект", Отказ)
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	// } #wortmann

КонецПроцедуры
